Repository: netlanc/ios-homeworks
Catalog: Navigation/Localization/Localizable.xcstrings
Source language: en
Languages: ru

# alert.text-default
source: Unknown error
ru: Неизвестная ошибка

# alert.title-default
source: Error
ru: Ошибка

# banner.name
source: I am Groot
ru: Я есть Грут

# banner.text
source: Merry Christmas and Happy New Year...
ru: С рождеством и новым годом поздравляет...

# coredata.error.deleting-liked
source: Error deleting liked post index: %@
ru: Ошибка при удалении индекса понравившегося поста: %@

# coredata.error.fetching-liked
source: Error fetching liked post index: %@
ru: Не найден индекс понравившегося поста: %@

# coredata.error.load
source: Failed to load Core Data stack: %@
ru: Не удалось загрузить данные: %@

# coredata.error.unresolved
source: Unresolved error %@, %@
ru: Неизвестная ошибка %@, %@

# feed.check.button-text
source: Check
ru: Проверить

# feed.check.error.empty
source: Fill in the field with the text
ru: Заполните поле с текстом

# feed.check.error.ok
source: The secret word is not true
ru: Секретное слово не верно

# feed.check.input-placeholder
source: Enter the text…
ru: Введите текст…

# feed.check.label
source: Checking the entered word
ru: Проверка введенного слова

# feed.check.notice.ok
source: The secret word is entered correctly
ru: Секретное слово введено правильно

# feed.title
source: Feed
ru: Лента

# gallery.title
source: Photo gallery
ru: Фото галерея

# info.button.text-tap
source: Hit
ru: Нажми

# info.label.default
source: Something is loading up now
ru: Сейчас что то подгрузится

# info.planet.text
source: The period of rotation of the planet %@ around its star - %@
ru: Период обращения планеты %@ вокруг своей звезды - %@

# info.tap.alert-message
source: Message
ru: Сообщение

# info.tap.alert-title
source: Title
ru: Заголовок

# liked.empty
source: Nothing has been added to your favorites yet
ru: Еще ничего не добавлено в понравившиеся

# liked.title
source: Liked posts
ru: Понравившиеся посты

# login.button.login
source: Log In
ru: Войти

# login.error.input-empty
source: Please fill in your username and password
ru: Заполните пожалуйста логин и пароль

# login.input.password
source: Password
ru: Пароль

# login.input.title-brtf
source: Choosing a password
ru: Подбираем пароль

# login.input.username
source: User name
ru: Имя

# login.label.note
source: Note Another user User login: netlanc@yandex.ru Password: password1
ru: Примечание Другой пользователь Логин пользователя: netlanc@yandex.ru Пароль: password1

# map.alert-to-find
source: To find
ru: Найти

# map.alert.placeholder
source: City
ru: Город

# map.alert.title
source: Enter the city
ru: Введите город

# map.button.hybrid
source: Hybrid
ru: Гибрид

# map.button.satellite
source: Satellite
ru: Спутник

# map.button.standart
source: Standard
ru: Стандартная

# map.clear-pins
source: Clear pins
ru: Очистить метки

# map.error.not-coordinate
source: The coordinates of the destination are missing
ru: Координаты пункта назначения отсутствуют

# map.error.not-find-location
source: The location for the specified city could not be found
ru: Не удалось найти местоположение для указанного города

# map.error.not-route
source: Error when building the route:%@
ru: Ошибка при построении маршрута: %@

# map.search-city
source: City Search
ru: Поиск города

# nav.back
source: Back
ru: Назад

# network.error.json
source: Failed to parse JSON data
ru: Не удалось проанализировать данные в формате JSON

# photo.label.text
source: Photo
ru: Фото

# post.read
source: Read the post
ru: Читать пост

# post.show-data
source: Show data
ru: Показать данные

# post.title-default
source: Post
ru: Пост

# post.view
source: Show the post
ru: Показать пост

# profile.loading
source: Loading...
ru: Загрузка...

# profile.status.button.title
source: Set status
ru: Обновить статус

# profile.text.label.placeholder
source: Fill in the text…
ru: Заполните текст…

# sys.cancel
source: Cancel
ru: Отмена

# sys.error.auth
source: You need to log in
ru: Нужно залогиниться

# sys.error.create-cell
source: Failed to create a cell
ru: Не удалось создать ячейку

# tab.feed
source: Feed
ru: Лента

# tab.liked
source: Liked
ru: Понравилось

# tab.map
source: Map
ru: Карта

# tab.profile
source: Profile
ru: Профиль
